import pandas as pd

In [68]:
pd.Series()

Series([], dtype: object)

In [182]:
a = ['dog','cat','frog','horse']
b = [4,4,4,4]
pd.DataFrame([a,b])

     0    1     2      3
0  dog  cat  frog  horse
1    4    4     4      4

In [ ]:
pd.Series([2,3,4,5])

In [176]:
mySeries = pd.Series(['a','b','c'])

In [183]:
pd.DataFrame({'animal' : a , 'legs' : b})

  animal  legs
0    dog     4
1    cat     4
2   frog     4
3  horse     4

In [199]:
z = {'animal' : 'dog', ' legs' : 4} 
x = {'animal' : 'cat', 'legs' : 4}
y = {'animal' : 'horse', 'legs' :4}
pd.DataFrame([z,y,x])

  animal   legs  legs
0    dog    4.0   NaN
1  horse    NaN   4.0
2    cat    NaN   4.0

In [202]:
my_df = pd.DataFrame({'things':[0,1,2,3,4,5,6,7,8,9,10],
                      'stuff': ['a','a','a','a','a','a','a','a','a','a','a']})

In [205]:
my_df.head(8)

   things stuff
0       0     a
1       1     a
2       2     a
3       3     a
4       4     a
5       5     a
6       6     a
7       7     a

In [207]:
my_df.tail(4)

    things stuff
7        7     a
8        8     a
9        9     a
10      10     a

In [208]:
my_df['things']

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
Name: things, dtype: int64

In [209]:
my_df[['things', 'stuff']]

    things stuff
0        0     a
1        1     a
2        2     a
3        3     a
4        4     a
5        5     a
6        6     a
7        7     a
8        8     a
9        9     a
10      10     a

In [210]:
my_df.loc[0]

things    0
stuff     a
Name: 0, dtype: object

In [211]:
my_df.iloc[0]

things    0
stuff     a
Name: 0, dtype: object

In [212]:
my_df.iloc[3:5]

   things stuff
3       3     a
4       4     a

In [214]:
my_df[my_df['things'] < 4]['stuff']

0    a
1    a
2    a
3    a
Name: stuff, dtype: object

In [215]:
my_df.index

RangeIndex(start=0, stop=11, step=1)

In [216]:
my_df.columns

Index(['things', 'stuff'], dtype='object')

In [218]:
list(range(0,50,3))

[0, 3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48]

In [15]:
import pandas as pd

# Create a DataFrame
data = {
    'Animal': ['Dog', 'Cat', 'Frog'],
    'Legs': [4, 4, 4],
    'Color': ['Brown', 'White', 'Green']
}
df = pd.DataFrame(data)
df

  Animal  Legs  Color
0    Dog     4  Brown
1    Cat     4  White
2   Frog     4  Green

In [17]:
# View the head of the DataFrame
df.head()

  Animal  Legs  Color
0    Dog     4  Brown
1    Cat     4  White
2   Frog     4  Green

In [19]:
# View the index
df.index

RangeIndex(start=0, stop=3, step=1)

In [21]:
# Select and view the first column
df['Animal']

0     Dog
1     Cat
2    Frog
Name: Animal, dtype: object

In [23]:
# Select and view the first row
df.iloc[0]

Animal      Dog
Legs          4
Color     Brown
Name: 0, dtype: object

In [25]:
# Create a DataFrame using a list of dictionaries
data_list = [
    {'Animal': 'Dog', 'Legs': 4, 'Color': 'Brown'},
    {'Animal': 'Cat', 'Legs': 4, 'Color': 'White'},
    {'Animal': 'Frog', 'Legs': 4, 'Color': 'Green'}
]
df_alternative = pd.DataFrame(data_list)
df_alternative

  Animal  Legs  Color
0    Dog     4  Brown
1    Cat     4  White
2   Frog     4  Green

In [29]:
# Export the DataFrame to a CSV file
df.to_csv('animal_data.csv', index=False)

### Questions and Answers

#### 1. What does the "write/render/evaluate" loop provide for creators of interactive data visualizations?
The "write/render/evaluate" loop enables creators to iteratively design and refine their visualizations. By immediately seeing the rendered output after writing code and evaluating its effectiveness, creators can quickly make adjustments to improve clarity and impact.

#### 2. Why are dynamic, interactive data visualizations useful when communicating data?
Dynamic and interactive visualizations allow users to explore data in ways static charts cannot. They help reveal trends, patterns, and insights by enabling viewers to zoom, filter, and interact with the visual elements, making the data story more engaging and accessible.

#### 3. Do you agree with Murray's claim that open-source tools that avoid proprietary software are best for publishing data visualization?
I agree with Murray's claim. Open-source tools promote accessibility, collaboration, and innovation. They reduce reliance on expensive proprietary software, making data visualization tools available to a broader audience. Moreover, open-source tools often support standards that ensure greater flexibility and interoperability.

In [37]:
df.to_csv('animal_data.csv', index=False)